[
    {
        "title": "GridTap",
        "link": "https://grid-tap.com/",
        "description": "GridPay is a full-stack, multi-tenant SaaS platform for water utilities, designed to manage customer accounts, meter readings, billing, and payments across multiple utility companies within a single system. \n Each tenant utilizes their own comprehensive billing workflows including flat and tiered rate calculations, VAT handling, payment tracking, and downloadable merged PDFs.\n Designed and developed by myself, leveraging Cursor.ai as a development tool to accelerate implementation, the application serves existing water utility companies in the Negros Region.",
        "tags": ["MongoDB", "React", "ExpressJS", "NodeJS", "AWS EC2", "Docker", "AWS Cloudfront"],
        "image": "https://github.com/Reinigen/webportfolio/blob/master/webportfolio/public/GridPay%20Logo.png?raw=true"
    },
    {
        "title": "PixelForge E-Commerce API",
        "link": "https://documenter.getpostman.com/view/17410151/2sAYQgiUkx",
        "description": "Developed a RESTful API for an e-commerce web application, supporting user authentication, product management, shopping carts, and order processing. \n Designed structured endpoints to enable secure data access and seamless integration with frontend clients.",
        "tags": ["NodeJS", "ExpressJS", "Postman"],
        "image": "https://raw.githubusercontent.com/Reinigen/pixel-forge-ecommerce-app/refs/heads/main/public/Pixel%20Forge.png"
    },
    {
        "title": "PixelForge E-Commerce Web-App",
        "link": "https://github.com/Reinigen/pixel-forge-ecommerce-app/tree/main#",
        "description": "PixelForge is a full-stack e-commerce web application which enables dynamic product browsing, shopping cart management, and user interactions. \n Solo developed using Zuitt bootcamp guidelines, with an emphasis on maintainable code structure and modern frontend tooling. \n Implemented responsive UI components, client-side routing, state management, and RESTful API integration delivering a streamlined online shopping experience.",
        "tags": ["React", "NodeJS", "ExpressJS", "MongoDB"],
        "image": "https://raw.githubusercontent.com/Reinigen/pixel-forge-ecommerce-app/refs/heads/main/public/Pixel%20Forge.png"
    }

]